;------------------------------------------------------------------------
;  Программа вывода сообщения на экран и ввода строки с клавиатуры
;------------------------------------------------------------------------

;----------------------  Объявления перменных   -------------------------
  SECTION .data                   ;Секция иницированных данных
  msg: DB 'Введите строку:',10    ;Сообщения плюс
                                  ;символ перевода строки
  msgLen: EQU $-msg                ;Длина переменной 'msg'

  SECTION .bss           ;Секция не инициированных данных
  buf1:   RESB 80        ;Буфер размером 80 байт

;--------------------------- Текст программы -----------------------------

  SECTION .text          ;Код программы
  GLOBAL _start          ;Начало программы
    _start:              ;точка входа в программу

;--------------------------Системный вызов 'write'-----------------------
;после вызова инструкции 'int 80h'на экран будет
; выведено сообщения из переменной 'msg' длиной 'msgLen'

 mov eax,4               ;Системный вызов для чтения (sys_write)
 mov ebx,1               ;Описатель файла 1 - стандартный ввод
 mov ecx,msg             ;Адрес строки 'msg' в 'ecx'
 mov edx,msgLen          ;Размер строки 'msg' в  'edx'
 int 80h                 ;Вызов ядра

;-----------------------Системный вызов 'read' --------------------------
;После вызова инструкции 'int 80h' программа будет ожидать ввода строки
;которая будет записана в переменную 'buf1' размером 80 байт

 mov eax,3                ;Системный вызов для чтения (sys_read)
 mov ebx,0                ;Дискриптор файла 0 - стандартный ввод
 mov ecx,buf1             ;Адрес буфера под вводимую строки
 mov edx, 80              ;Длина вводимой строки
 int 80h                  ;Вызов ядра

;------------------------ Системный вызов 'exit' ---------------------------
;После вызова инструкции 'int 80h' программа завершит работу

 mov eax,1                ;Системный вызов для выхода (Sys_exit)
 mov ebx,0                ;Выход с кодом возврата 0(Без ошибок)
 int 80h                  ;ВЫзов ядра